#+title: Cloud Infrastructure Provisioning
#+startup: showeverything

**** Create a subnet for the Kubernetes cluster

#+BEGIN_SRC sh :results output :exports both
gcloud compute networks subnets create kubernetes \
  --network kubernetes \
  --range 10.240.0.0/24 \
  --region us-central1
#+END_SRC

#+RESULTS:
: NAME        REGION       NETWORK     RANGE
: kubernetes  us-central1  kubernetes  10.240.0.0/24

**** DONE Allow ping from anywhere:

#+BEGIN_SRC sh :results output  :exports both
gcloud compute firewall-rules create kubernetes-allow-icmp \
  --allow icmp \
  --network kubernetes \
  --source-ranges 0.0.0.0/0 
#+END_SRC

#+RESULTS:
: NAME                   NETWORK     SRC_RANGES  RULES  SRC_TAGS  TARGET_TAGS
: kubernetes-allow-icmp  kubernetes  0.0.0.0/0   icmp

**** DONE Allow ssh from anywhere

#+BEGIN_SRC sh :results output  :exports both
gcloud compute firewall-rules create kubernetes-allow-ssh \
  --allow tcp:22 \
  --network kubernetes \
  --source-ranges 0.0.0.0/0
#+END_SRC

#+RESULTS:
: NAME                  NETWORK     SRC_RANGES  RULES   SRC_TAGS  TARGET_TAGS
: kubernetes-allow-ssh  kubernetes  0.0.0.0/0   tcp:22

**** DONE Allow API server port for health check monitoring

The healthchecks will be coming from the =130.211.0.0/22= range in the Google Cloud platform:
https://cloud.google.com/compute/docs/load-balancing/health-checks

#+BEGIN_SRC sh :results output  :exports both
gcloud compute firewall-rules create kubernetes-allow-healthz \
  --allow tcp:8080 \
  --network kubernetes \
  --source-ranges 130.211.0.0/22
#+END_SRC

#+RESULTS:
: NAME                      NETWORK     SRC_RANGES      RULES     SRC_TAGS  TARGET_TAGS
: kubernetes-allow-healthz  kubernetes  130.211.0.0/22  tcp:8080

#+BEGIN_QUOTE
Modify your firewall rules so HTTP(S) traffic can come from your load
balancer. Both incoming traffic and health checks will be be sent to
your Kubernetes service from an IP in the 130.211.0.0/22 range.
#+END_QUOTE

Source: https://cloud.google.com/container-engine/docs/tutorials/http-balancer

**** Public IPs required to be able to connect to the API server from Kubernetes

#+BEGIN_SRC sh :results output :exports both
gcloud compute addresses create kubernetes
#+END_SRC

#+RESULTS:
#+begin_example

STDERR: 

For the following addresses:
 - [kubernetes]
choose a region:
 [1] asia-east1
 [2] europe-west1
 [3] us-central1
 [4] us-east1
 [5] us-west1
Please enter your numeric choice:  3
ERROR: (gcloud.compute.addresses.create) Unable to prompt. Specify the [--region] flag.
#+end_example

#+BEGIN_SRC 
Created [https://www.googleapis.com/compute/v1/projects/EXAMPLE-99999/regions/us-central1/addresses/kubernetes].
---
address: AAA.BBB.CCC.100
kind: compute#address
name: kubernetes
region: us-central1
selfLink: https://www.googleapis.com/compute/v1/projects/EXAMPLE-99999/regions/us-central1/addresses/kubernetes
status: RESERVED
#+END_SRC

**** Confirm the address

#+BEGIN_SRC sh :results output :exports both
gcloud compute addresses list kubernetes
#+END_SRC

#+RESULTS:
: NAME        REGION       ADDRESS          STATUS
: kubernetes  us-central1  AAA.BBB.CCC.100  RESERVED

